\section{Bloodhound}
\label{tool:bloodhound}
\subsection*{Introduction}

\subsection*{Installation}
\begin{enumerate}
    \item start neo4j service
    \item log on  https://localhost:7474/ (neo4j/neo4j)
    \item change password
    \item login neo4j/password set at previous stage
\end{enumerate}

\verb+~/.config/bloodhound/+


install custom queries 
\verb+~/.config/bloodhound/customqueries.json+

\subsection*{PurgeDB}
\begin{enumerate}
    \item launch bloodhound 
    \item on database info scroll to bottom
    \item clic clear Database
\end{enumerate}



\subsection*{Checking Remote Access Rights}
\label{tool:bloodhound:remote-access}

\begin{itemize}
    \item For a given  user {\bf Node Info > Execution Rights}
    \item Globaly {\bf Analysis: Find Workstations where Domain Users can RDP}
    \item Globaly {\bf Analysis: Find Servers where Domain Users can RDP}

\end{itemize}

\subsection*{Node attributes}

\subsection{DB Manipulation}
\url{https://github.com/SadProcessor/Cheats/blob/master/DogWhispererV2.md#iv--db-manipulation}
\subsubsection{Create Node}
\subsubsection{Add/Update Node property}


\subsection*{Custom Cypher query}
\label{tool:bloodhound:raw-query}

\url{https://hausec.com/2019/09/09/bloodhound-cypher-cheatsheet/}

Cypher queries are made of nodes (User, Group, Computer…), relationships
(MemberOf, AdminTo…) and properties (name, description…).

The nodes are symbolized by () and the relationships by []. For instance, users
are symbolized by (:User) and the “member of” relationship by [:MemberOf].
Variables can be assigned for further use: (variable:User) for example.

\subsubsection*{Search Object}

\begin{verbatim}
Match (n:<object_type>) WHERE <condition> return n
\end{verbatim}

\verb+object_type+:
\begin{itemize}
    \item \verb+User+
\end{itemize}

Examples:
\begin{verbatim}
# Return all the users
MATCH (u:User) RETURN u

# Return the users with the name containing "ADMIN"
MATCH (u:User) WHERE u.name =~ ".*ADMIN.*" RETURN u.name
\end{verbatim}

\subsubsection*{Search Path}

Examples:
\begin{verbatim}

# Return all the users and the computer they are admin to
MATCH p = (u:User)-[:AdminTo]->(c:Computer) RETURN p

# Return the  users with the name containing "ADMIN" and the computer they are admin to
MATCH p = (u:User)-[:AdminTo]->(c:Computer) WHERE u.name =~ ".*ADMIN.*" RETURN p
\end{verbatim}

\subsubsection{Some requests}

At the bottom of the screen in  the {\bf Raw Query} or adding as a custom
Query (Analysis > Custom Queries 

\begin{itemize}
    \item List all sessions: \\
        \verb+MATCH p1=shortestPath((u1:User)-[r1:MemberOf*1..]->(g1:Group)) MATCH p2=(c:Computer)-[:HasSession*1..]->(u1) RETURN p2+
    \item Remote Management Users: \\
        \verb+MATCH p1=shortestPath((u1:User)-[r1:MemberOf*1..]->(g1:Group)) MATCH p2=(u1)-[:CanPSRemote*1..]->(c:Computer) RETURN p2+
    \item SQL Admin Users: \\
        \verb+MATCH p1=shortestPath((u1:User)-[r1:MemberOf*1..]->(g1:Group)) MATCH p2=(u1)-[:SQLAdmin*1..]->(c:Computer) RETURN p2+
\end{itemize}


\begin{itemize}
    \item
        \url{https://github.com/hausec/Bloodhound-Custom-Queries/blob/master/customqueries.json}
    \item 
        \url{https://github.com/CompassSecurity/BloodHoundQueries/blob/master/customqueries.json}
    \item
        \url{https://raw.githubusercontent.com/ShutdownRepo/Exegol/master/sources/bloodhound/customqueries.json}
    \item
        \url{https://github.com/ly4k/Certipy/blob/main/customqueries.json}
\end{itemize}

\subsection*{links}

\url{https://porterhau5.com/blog/extending-bloodhound-track-and-visualize-your-compromise/}

\url{https://neo4j.com/docs/cypher-refcard/current/}

\url{https://bloodhound.readthedocs.io/en/latest/}

\url{https://github.com/CompassSecurity/BloodHoundQueries}
\url{https://blog.cptjesus.com/posts/introtocypher}
\url{https://github.com/SadProcessor/Cheats/blob/master/DogWhispererV2.md}
\url{https://hausec.com/2019/09/09/bloodhound-cypher-cheatsheet/}

